pannel_tips = """
### 两种分镜切割的方法

#### 💡 WebUi 提示词换行快速切割

直接在SD WebUi 中利用提示词换行，有多少行，就出多少张图

#### 💡 云端分镜脚本批量生成

通过使用 https://ai.quwuxian.com 云端分镜脚本编辑器完成分镜脚本的编辑，在SD WebUi 中一键批量出图

#### 🎸 这两种方法，都需要打开下方 脚本(Script) 中的 【AI漫文创作助手-批量出图】 根据提示完成出图操作

#### 🎸 【AI漫文创作助手】完全兼容WebUi的各项设置，在不改变原生配置的前提下，进行了更灵活的扩充

"""

prompts_split_tip = """

### 🪄 恭喜，您现在可以开始批量出图了

### 🪄 你可以尝试一下，在提示词中输入下面这段内容

```
girl, car,short hair,red hair, sports bra , 
boy, sea,short hair,black hair,  
```

这段提示词通过换行进行分段

###  🪄 提示词输入好之后，就可以试一下点击【生成图片】按钮

💡 如果已经顺利生成图片，那么恭喜，你可以愉快的玩耍了


```
在这个模式下，提供了最灵活的提示词分段批量出图提高效率的方法，具备更高的灵活性，但是出图效果方面需要下一些功夫
```

### 🎸 同时，我们也提供了更方便的云端脚本编辑模式

💡 有更精准的分镜内容控制

💡 更丰富的提示词资源

💡 不断迭代的出图效果

如果你需要，可以切换到云端脚本面板进行尝试


💡 云端脚本，需要 打开 https://ai.quwuxian.com 进行脚本编辑和获取脚本Guid
"""

yunduan_tips = """
```
💡 云端脚本需要进入  https://ai.quwuxian.com  进行编辑
💡 脚本编辑完成后，会生成 脚本Guid ，复制后，黏贴到 这个界面的云端脚本Guid 中
💡 黏贴好之后，点击【加载云端脚本】，将脚本内容加载到WebUi中
💡 提示加载完成之后，就可以点击【生成图片】 按钮生成试一下了
🎃 每次在云端修改完脚本之后，都需要在这里重新加载一次，替换到原来的
🎃 云端脚本使用完成后，需要点击【卸载云端脚本】 才会恢复到 提示词切割 的模式
```
"""